SunCity/src/Documents/АктПриемаПередачиИСМПТК/АктПриемаПередачиИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемаПередачиИСМПТК</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеАктПриемаПередачиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИСМПТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВИСМПТ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ХозяйственныеОперацииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАкта</name>
    <type>
      <types>EnumRef.ВидыДокументаИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвязанныйАкт</name>
    <comment>Первичный Акт для исправляемого АПП</comment>
    <type>
      <types>DocumentRef.АктПриемаПередачиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерСвязанногоАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>42</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУведомлениеОРасхождении</name>
    <type>
      <types>DocumentRef.УведомлениеОРасхожденииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегНомерНаБумажномНосителе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпискиНаБумажномНосителе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.ПользователиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>EnumRef.ВидыПродукцииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапОформления</name>
    <type>
      <types>EnumRef.ЭтапыОформленияДокументовИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУведОРасхождениях</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАППИсправленный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАПППервичный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <comment>Количество потребительских упаковок в GTIN</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.ЕдиницаИзмеренияИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатурыИСМПТК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>EnumRef.ВидыУпаковокИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество потребительских упаковок</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTINВерхнегоУровня</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расхождения</name>
    <comment>(проверка содержимого во входящих документах)</comment>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>EnumRef.ВидыУпаковокИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество потребительских упаковок</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСверкиКода</name>
      <type>
        <types>EnumRef.СтатусыСверкиКодаИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTINВерхнегоУровня</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Итоги</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатурыИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>DefinedType.СтавкаНДСИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/Enums/СтатусыДокументовИСМПТК/СтатусыДокументовИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовИСМПТК</name>
  <comment>(Сервер)</comment>
  <enumValues>
    <name>Черновик</name>
    <comment>0</comment>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ОжидаетПриемку</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ПринятПодтвержден</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
    <comment>5</comment>
  </enumValues>
  <enumValues>
    <name>Отозван</name>
    <comment>16</comment>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
    <comment>17</comment>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
    <comment>8</comment>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
    <comment>10</comment>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
    <comment>IN_PROGRESS</comment>
  </enumValues>
  <enumValues>
    <name>Оформлен</name>
    <comment>CHECKED_OK</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриПроверке</name>
    <comment>CHECKED_NOT_OK</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриОбработке</name>
    <comment>PROCESSING_ERROR</comment>
  </enumValues>
  <enumValues>
    <name>НеОпределен</name>
    <comment>UNDEFINED</comment>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ВидыДокументаИСМПТК/ВидыДокументаИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументаИСМПТК</name>
  <enumValues>
    <name>Исправленный</name>
  </enumValues>
  <enumValues>
    <name>Исходный</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/АктПриемаПередачиИСМПТК/Forms/ФормаСпискаВходящих/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		Организация = Параметры.Отбор.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;

	СобытияФормИСМПТКПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СобытияФормИСМПТККлиентПереопределяемый.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = РаботаСДокументамиИСМПТККлиентСервер.ИмяСобытияЗаписьАктПриемаПередачи() Тогда
		
		Элементы.Список.Обновить();
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если Не ТекущиеДанные = Неопределено Тогда
			ИзменитьКоманднуюПанельДокумента(ТекущиеДанные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОчиститьСообщения();
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	МножественныйВыбор = Элементы.Список.ВыделенныеСтроки.Количество() > 1 ;
	ИзменитьКоманднуюПанельДокумента(ТекущиеДанные, МножественныйВыбор);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)	
	
	УстановитьБыстрыйОтбор("Организация", Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьБыстрыйОтбор("Контрагент", Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	
	УстановитьБыстрыйОтбор("Состояние", Состояние);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьБыстрыйОтбор(ВидЭлемента, ЗначениеЭлемента)
	
	ОбщегоНазначенияИСМПТККлиентСервер.ИзменитьЭлементОтбораСписка(Список, ВидЭлемента, ЗначениеЭлемента, ЗначениеЗаполнено(ЗначениеЭлемента));
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьКоманднуюПанельДокумента(ТекущиеДанные = Неопределено, МножественныйВыбор = Ложь)
	
	ИспользуютсяЭтапы = ОбщегоНазначенияИСМПТКВызовСервера.ПроверитьЗначениеКонстанты("ИспользоватьЭтапыОформленияДокументовИСМПТК");
	МожноПодтверждатьБезСверки = ОбщегоНазначенияИСМПТКПереопределяемый.ЭтоПолноправныйПользователь(ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ТекущийПользователь(), Истина)
								Или РольДоступна("ПравоПодтвержденияАктаБезПроверкиИСМПТК");
									
	Если Не МножественныйВыбор
		И НЕ ТекущиеДанные = Неопределено Тогда
		
		МожноПодтвердить = ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовИСМПТК.ОжидаетПриемку")
						   И (МожноПодтверждатьБезСверки ИЛИ ТекущиеДанные.Проверен);
		МожноОтклонить   = ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовИСМПТК.ОжидаетПриемку");
		МожноОформитьУОР = ТекущиеДанные.ТипАкта = ПредопределенноеЗначение("Перечисление.ВидыДокументаИСМПТК.Исходный")
						   И Не ТекущиеДанные.Ссылка.Расхождения.Количество() = 0;
	Иначе
		МожноПодтвердить = Истина;
		МожноОтклонить   = Истина;
		МожноОформитьУОР = Истина;
	КонецЕсли;
	
	//Команды АПИ
	ОбщегоНазначенияИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокДокументАПППодтвердить", 
																	   "Видимость", МожноПодтвердить);
	ОбщегоНазначенияИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокДокументАППОтклонить",
																	   "Видимость", МожноОтклонить);	
	
	ОбщегоНазначенияИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаВвестиУведомлениеОРасхождении",
																	   "Видимость", МожноОформитьУОР);
КонецПроцедуры

#Область УведомлениеОРасхождении

&НаКлиенте
Процедура ВвестиУведомлениеОРасхождении(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		
		Если Элементы.Список.ТекущиеДанные.ТипАкта = ПредопределенноеЗначение("Перечисление.ВидыДокументаИСМПТК.Исходный") Тогда
			Если МожноВводитьУОРпоАПП(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Основание", Элементы.Список.ТекущиеДанные.Ссылка);
				ОткрытьФорму("Документ.УведомлениеОРасхожденииИСМПТК.ФормаОбъекта", ПараметрыФормы);
			Иначе
				ТекстСообщения = НСтр("ru='На основании документа %1 уже оформлено Уведомление о расхождениях!'");
				ТекстСообщения = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения, Элементы.Список.ТекущиеДанные.Ссылка);
				ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, , , "Форма.Объект");
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru='Документ %1 исправленный. Уведомление можно вводить только на основании первичного Акта.'");
			ТекстСообщения = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения, Элементы.Список.ТекущиеДанные.Ссылка);
			ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения, , , "Форма.Объект");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция МожноВводитьУОРпоАПП(АПП)

	Возврат ?(ЗначениеЗаполнено(АПП.ИдентификаторУведОРасхождениях), Ложь, Истина);
	
КонецФункции

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ОбщегоНазначенияИСМПТККлиентПереопределяемый.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ОбщегоНазначенияИСМПТКПереопределяемый.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
